src/Catalogs/уатТарифыЗП/уатТарифыЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатТарифыЗП</name>
  <comment>Тарифы зарплаты сотрудников</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГруппировкаТарифа1</name>
    <comment>Группировка тарифа 1</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаТарифа2</name>
    <comment>Группировка тарифа 2</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаТарифа3</name>
    <comment>Группировка тарифа 3</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <comment>Вид начисления</comment>
    <type>
      <types>ChartOfCalculationTypesRef.уатОсновныеНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СложныйТариф</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <comment>Размер тарифа в валюте управленческого учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПоСтрокам</name>
    <comment>Расчет начислений отдельно по строкам Задания путевого листа, либо по итогам </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВыручки</name>
    <comment>0 - Заказы на ТС, 1 - Маршрутный лист</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Применение</name>
    <comment>0 - Путевые листы, 1 - Маршрутные листы, 2 - Ремонтные листы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРасчета</name>
    <attributes>
      <name>ЗнакГруппировки1</name>
      <comment>Знак группировки 1</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакГруппировки2</name>
      <comment>Знак группировки 2</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакГруппировки3</name>
      <comment>Знак группировки 3</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки1</name>
      <comment>Значение группировки 1</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки2</name>
      <comment>Значение группировки 2</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки3</name>
      <comment>Значение группировки 3</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <comment>Размер тарифа в валюте управленческого учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбластиДействия</name>
    <attributes>
      <name>ВидОбластиДействия</name>
      <type>
        <types>EnumRef.уатВидыОбластейДействияТарифовТС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОбластиДействия</name>
      <type>
        <types>DefinedType.уатВидыОбластейДействияТарифа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <comment>Организация</comment>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/уатВидыОбластейДействияТарифовТС/уатВидыОбластейДействияТарифовТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОбластейДействияТарифовТС</name>
  <enumValues>
    <name>ВидПеревозки</name>
  </enumValues>
  <enumValues>
    <name>ГрузовоеМесто</name>
  </enumValues>
  <enumValues>
    <name>ДоговорКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>Контрагент</name>
  </enumValues>
  <enumValues>
    <name>Маршрут</name>
  </enumValues>
  <enumValues>
    <name>МодельПрицепа</name>
  </enumValues>
  <enumValues>
    <name>МодельТягача</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ОбъектСтроительства</name>
  </enumValues>
  <enumValues>
    <name>Прицеп</name>
  </enumValues>
  <enumValues>
    <name>ПунктНазначения</name>
  </enumValues>
  <enumValues>
    <name>ПунктОтправления</name>
  </enumValues>
  <enumValues>
    <name>ТипПрицепа</name>
  </enumValues>
  <enumValues>
    <name>ТипТягача</name>
  </enumValues>
  <enumValues>
    <name>Тягач</name>
  </enumValues>
  <enumValues>
    <name>ГеозонаНазначения</name>
  </enumValues>
  <enumValues>
    <name>ГеозонаОтправления</name>
  </enumValues>
  <enumValues>
    <name>ВидГруза</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>ВидРемонта</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеПеревозки</name>
  </enumValues>
  <enumValues>
    <name>КлассВодителя</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ВидУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ТипКонтейнера</name>
  </enumValues>
</mdclass:Enum>

src/Enums/уатСпособыРасчетаОплатыТруда/уатСпособыРасчетаОплатыТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСпособыРасчетаОплатыТруда</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>СдельныйЗаработок</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентомОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>ПроцентомОтВидовНачислений</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаНочныеЧасы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаПраздничныеИВыходные</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCalculationTypes/уатОсновныеНачисления/уатОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>уатОсновныеНачисления</name>
  <comment>(уат)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.уатОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ДоплатаЗаНочныеЧасы</name>
      <description>Доплата за ночные часы</description>
    </items>
    <items>
      <name>ДоплатаЗаПраздничныеИВыходные</name>
      <description>Доплата за работу в праздники и выходные</description>
    </items>
    <items>
      <name>ОплатаЗаРемонт</name>
      <description>Оплата за участие в ремонте</description>
    </items>
    <items>
      <name>ОплатаПоЧасовомуТарифу</name>
      <description>Оплата по часовому тарифу</description>
    </items>
    <items>
      <name>ПроцентомОтВыручки</name>
      <description>Процентом от выручки</description>
    </items>
    <items>
      <name>ПроцентомОтНачислений</name>
      <description>Процентом от прочих начислений</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата по выработке</description>
    </items>
    <items>
      <name>ФиксированнойСуммой</name>
      <description>Фиксированной суммой</description>
    </items>
  </predefined>
  <attributes>
    <name>КодВидаНачисленияДляВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаОплатыТруда</name>
    <type>
      <types>EnumRef.уатСпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/Catalogs/уатТарифыЗП/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция СписокДоступныхВидовОбластиДействия(ВидНачисления, РасчетПоСтрокам, Применение) Экспорт
	Рез = Новый СписокЗначений;
	
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Тягач, НСтр("en='Vehicle';ru='ТС / Прицеп'"));
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.МодельТягача, НСтр("en='Vehicle model';ru='Модель ТС / прицепа'"));
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ТипТягача, НСтр("en='Vehicle type';ru='Тип ТС / прицепа'"));
	
	Если ВидНачисления = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидРемонта);
		
	ИначеЕсли ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
		КонецЕсли;
		
	ИначеЕсли РасчетПоСтрокам ИЛИ Применение = 1 Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Подразделение);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
		КонецЕсли;
		
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктНазначения);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Номенклатура);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаОтправления);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаНазначения);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидГруза);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГрузовоеМесто);
		КонецЕсли;
		
	КонецЕсли;
	
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассВодителя);
	
	Возврат Рез;
КонецФункции

#КонецОбласти
